schreibfaul1/ESP32-audioI2S/src/Audio.h
  public:
    RingBuffer();
    ~RingBuffer();

    void          setBufsize(size_t size);
    size_t        getBufsize() const;
    size_t        init();
    bool          isInitialized() { return m_init; };
    void          reset();
    size_t        freeSpace() const;
    size_t        bufferFilled() const;
    size_t        writeSpace() const;
    size_t        readSpace() const;
    int32_t*      getWritePtr();
    int32_t*      getReadPtr();
    bool          bytesWritten(size_t bytes);
    bool          bytesRead(size_t bytes);
    size_t        write(const int32_t* src, size_t words);
    size_t        read(int32_t* dst, size_t words);
    size_t        peek(int32_t* dst, size_t words);
    inline size_t advanceIndex(size_t index, size_t words) const;
    void          showStatus();

  private:
    ps_ptr<int32_t>      m_buffer;
    size_t               m_bufSize = 0;
    size_t               m_readIndex = 0;
    size_t               m_writeIndex = 0;
    size_t               m_used = 0;
    bool                 m_init = false;
    mutable ps_ptr<char> m_log;
};

//----------------------------------------------------------------------------------------------------------------------

class Audio {
  private:
    AudioBuffer InBuff; // instance of input buffer
    RingBuffer  SamplesBuff;

  public:
    Audio(uint8_t i2sPort = I2S_NUM_0);
    ~Audio();
    std::mutex mutex_info; // mutex_info as member

    // callbacks ---------------------------------------------------------
    typedef enum {
        evt_info = 0,
        evt_id3data,
        evt_eof,
        evt_name,
        evt_icydescription,
        evt_streamtitle,
        evt_bitrate,
        evt_icyurl,
        evt_icylogo,
        evt_genre,
        evt_lasthost,
        evt_image,
        evt_lyrics,
        evt_log,
    } event_t;

    // Audio event type descriptions
    static constexpr std::array<const char*, 14> eventStr = {
        "info",            // evt_info
        "id3data",         // evt_id3data
        "eof",             // evt_eof
        "station_name",    // evt_name
        "icy_description", // evt_icydescription
        "streamtitle",     // evt_streamtitle
        "bitrate (b/s)",   // evt_bitrate
        "icy_url",         // evt_icyurl
        "icy_logo",        // evt_icylogo
        "genre",           // evt_genre
        "lasthost",        // evt_lasthost
        "cover_image",     // evt_image
        "lyrics",          // evt_lyrics
        "log",             // evt_log
    };

    typedef struct _msg { // used in info(audio_info_callback());
        const char*           msg = nullptr;
        const char*           s = nullptr;
        event_t               e = (event_t)0; // event type
        int32_t               i2s_num = 0;
        int32_t               arg1 = 0;
        int32_t               arg2 = 0;
        std::vector<uint32_t> vec = {}; // apic [pos, len, pos, len, pos, len, ....]
    } msg_t;
    inline static std::function<void(msg_t i)> audio_info_callback;
    using VolumeCurveFn = std::function<float(float t)>;
    // -------------------------------------------------------------------
    typedef enum : uint32_t { SR_ORIGIN = 0, SR_44100 = 44100, SR_48000 = 48000 } OutputSR_t;

    bool             openai_speech(const String& api_key, const String& model, const String& input, const String& instructions, const String& voice, const String& response_format, const String& speed);
    audiolib::hwoe_t dismantle_host(const char* host);
    bool             connecttohost(const char* host, const char* user = nullptr, const char* pwd = nullptr);
    bool             connecttospeech(const char* speech, const char* lang);
    bool             connecttoFS(fs::FS& fs, const char* path, int32_t fileStartTime = -1);
    void             setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl);
    bool             setAudioPlayTime(uint16_t sec);
    bool             setTimeOffset(int sec);
    bool             setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t MCLK = I2S_GPIO_UNUSED);
    bool             pauseResume();
    bool             isRunning() { return m_f_running; }
    void             loop();
    uint32_t         stopSong();
    void             forceMono(bool m);
    void             setOutputSampleRate(OutputSR_t sr);
    void             setBalance(float balance = 0.0f);
    void             setVolumeSteps(uint8_t steps);
    uint8_t          getVolumeSteps();
    void             setVolume(uint8_t vol, uint8_t curve = 0);
    void             setVolumeCurve(VolumeCurveFn curve);
    uint8_t          getVolume();
    void             setMute(bool mute);
    bool             getMute();
    int32_t          getI2sPort();
    uint32_t         getFileSize();
    uint32_t         getSampleRate();
    uint8_t          getBitsPerSample();
    uint8_t          getChannels();
    uint32_t         getBitRate();
    uint32_t         getAudioFileDuration();
    uint32_t         getAudioCurrentTime();
    uint32_t         getAudioFilePosition();
    bool             setAudioFilePosition(uint32_t pos);
    uint16_t         getVUlevel();
    uint32_t         inBufferFilled();  // returns the number of stored bytes in the inputbuffer
    uint32_t         inBufferFree();    // returns the number of free bytes in the inputbuffer
    uint32_t         getInBufferSize(); // returns the size of the inputbuffer in bytes
    void             inBufferStatus() { InBuff.showStatus(); }
    void             samplesBufferStatus() { SamplesBuff.showStatus(); }
    void             setTone(float gainLowPass, float gainBandPass, float gainHighPass);
    void             setI2SCommFMT_LSB(bool commFMT);
    int              getCodec() { return m_codec; }
    const char*      getCodecname() { return codecname[m_codec]; }
    const char*      getVersion();
    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

